-- phpMyAdmin SQL Dump
-- version 5.1.3
-- https://www.phpmyadmin.net/
--
-- 主機： localhost
-- 產生時間： 2022 年 06 月 08 日 12:24
-- 伺服器版本： 10.4.21-MariaDB
-- PHP 版本： 7.4.29

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫: `a_yun`
--

-- --------------------------------------------------------

--
-- 資料表結構 `good_deed_games`
--

CREATE TABLE `good_deed_games` (
  `sid` int(11) NOT NULL,
  `game_id` int(11) NOT NULL,
  `game_name` varchar(255) NOT NULL,
  `game_detail` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `good_deed_games`
--

INSERT INTO `good_deed_games` (`sid`, `game_id`, `game_name`, `game_detail`) VALUES
(1, 1, '扶老奶奶過馬路遊戲', '在可怕的車流中 帶領老奶奶過馬路 實在是功德一件'),
(2, 2, '消業障遊戲', '透過小球碎掉業障');

-- --------------------------------------------------------

--
-- 資料表結構 `good_deed_games_record`
--

CREATE TABLE `good_deed_games_record` (
  `sid` int(11) NOT NULL,
  `member_sid` int(11) NOT NULL,
  `member_account` varchar(255) NOT NULL,
  `member_name` varchar(255) NOT NULL,
  `member_birth` date NOT NULL,
  `member_death` date DEFAULT NULL,
  `play_date` datetime NOT NULL,
  `game_id` int(11) NOT NULL,
  `game_score` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `good_deed_games_record`
--

INSERT INTO `good_deed_games_record` (`sid`, `member_sid`, `member_account`, `member_name`, `member_birth`, `member_death`, `play_date`, `game_id`, `game_score`) VALUES
(1, 1, 'snowvalley28', '蔣阿水', '1891-02-08', '1931-08-25', '2019-02-23 00:00:00', 1, 55),
(2, 2, 'showgi1103', '李秀枝', '1923-11-03', NULL, '2020-05-02 00:00:00', 1, 23);

-- --------------------------------------------------------

--
-- 資料表結構 `good_deed_score`
--

CREATE TABLE `good_deed_score` (
  `sid` int(11) NOT NULL,
  `member_sid` int(11) NOT NULL,
  `member_account` varchar(255) NOT NULL,
  `member_password` int(255) NOT NULL,
  `member_name` int(255) NOT NULL,
  `member_birth` date NOT NULL,
  `member_death` date DEFAULT NULL,
  `test_score` int(11) DEFAULT NULL,
  `event_score` int(11) DEFAULT NULL,
  `charity_score` int(11) DEFAULT NULL,
  `game_score` int(11) DEFAULT NULL,
  `sum_score` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 資料表結構 `good_deed_test`
--

CREATE TABLE `good_deed_test` (
  `sid` int(11) NOT NULL,
  `test_sid` varchar(255) NOT NULL,
  `test_content` varchar(255) NOT NULL,
  `op1_content` varchar(255) NOT NULL,
  `op1_score` int(11) NOT NULL,
  `op2_content` varchar(255) DEFAULT NULL,
  `op2_score` int(11) DEFAULT NULL,
  `op3_content` varchar(255) DEFAULT NULL,
  `op3_score` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `good_deed_test`
--

INSERT INTO `good_deed_test` (`sid`, `test_sid`, `test_content`, `op1_content`, `op1_score`, `op2_content`, `op2_score`, `op3_content`, `op3_score`) VALUES
(1, 'test_Q1', '你認為人性...?', '人性本善', 3, '人性本惡', 5, '有錢才會善良', 2),
(2, 'test_Q2', '你覺得人與人之間的相處應該?', '銀貨兩訖', 3, '不求回報', 5, '自私自利', 2),
(3, 'test_Q3', '你小時候最常玩什麼遊戲?', '閃電布丁', 3, '鬼抓人', 5, ' 躲貓貓', 4),
(4, 'test_Q4', '傷心的時候聽?', '哀傷的歌', 3, '佛經', 5, '歡樂的歌', 2),
(5, 'test_Q5', '你覺得人生像...?', '一場旅行', 5, '一場災難', 3, '一盒巧克力', 4);

-- --------------------------------------------------------

--
-- 資料表結構 `good_deed_test_record`
--

CREATE TABLE `good_deed_test_record` (
  `sid` int(11) NOT NULL,
  `member_sid` int(11) NOT NULL,
  `member_account` varchar(255) NOT NULL,
  `member_id` varchar(255) NOT NULL,
  `member_name` varchar(255) NOT NULL,
  `member_birth` date NOT NULL,
  `member_death` date DEFAULT NULL,
  `test_Q1` int(11) DEFAULT NULL,
  `test_Q2` int(11) DEFAULT NULL,
  `test_Q3` int(11) DEFAULT NULL,
  `test_Q4` int(11) DEFAULT NULL,
  `test_Q5` int(11) DEFAULT NULL,
  `test_score` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `good_deed_test_record`
--

INSERT INTO `good_deed_test_record` (`sid`, `member_sid`, `member_account`, `member_id`, `member_name`, `member_birth`, `member_death`, `test_Q1`, `test_Q2`, `test_Q3`, `test_Q4`, `test_Q5`, `test_score`) VALUES
(101, 49690, '0nana9949', 'adsfd322', '吳小明', '1944-05-25', '2017-12-08', 3, 4, 5, 4, 2, 0),
(102, 32956, '1yyy2574', 'adsfd733', '李大頭', '1985-10-20', '2021-04-03', 3, 4, 5, 4, 2, 6317),
(103, 17234, '2cucumber1943', 'sdf187', '陳雅玲', '1956-05-14', '2011-10-16', 3, 4, 5, 4, 2, 14184),
(104, 83790, '3cucumber8532', 'oerie222', '王大頭', '1961-12-09', '2021-02-17', 3, 4, 5, 4, 2, 12540),
(105, 93655, '4cucumber1485', 'sdf861', '吳小明', '1982-07-25', '2021-01-08', 3, 4, 5, 4, 2, 10636),
(106, 19553, '5cucumber4380', 'adsfd253', '陳小明', '1982-12-07', '2013-03-28', 3, 4, 5, 4, 2, 16960),
(107, 83371, '6yyy5451', 'eesf108', '林大頭', '1942-01-08', '2011-03-31', 3, 4, 5, 4, 2, 23670),
(108, 66601, '7edward2931', 'oerie475', '王小明', '1940-02-18', '2014-01-25', 3, 4, 5, 4, 2, 13510),
(109, 56712, '8yyy1242', 'adsfd248', '李怡君', '1955-02-27', '2014-07-25', 3, 4, 5, 4, 2, 42424),
(110, 33076, '9ming7069', 'adsfd578', '王小明', '1949-01-23', '2021-08-02', 3, 4, 5, 4, 2, 57528),
(111, 23104, '10nana2166', 'sdf243', '王雅玲', '1953-12-07', '2021-07-17', 3, 4, 5, 4, 2, 48700),
(112, 85755, '11cucumber6642', 'oerie979', '陳小明', '1983-02-21', '2014-05-20', 3, 4, 5, 4, 2, 86383),
(113, 62584, '12yyy8161', 'sdf287', '林小華', '1960-02-14', '2017-01-31', 3, 4, 5, 4, 2, 81696),
(114, 98653, '13cucumber9375', 'oerie634', '陳怡君', '1957-10-21', '2012-07-03', 3, 4, 5, 4, 2, 75400),
(115, 89990, '14ming8904', 'oerie698', '林大頭', '1969-11-07', '2018-05-26', 3, 4, 5, 4, 2, 89544),
(116, 15681, '15cucumber2333', 'sdf427', '李雅玲', '1978-05-14', '2021-03-21', 3, 4, 5, 4, 2, 79080),
(117, 70224, '16cucumber2623', 'adsfd741', '王大頭', '1968-02-29', '2022-03-15', 3, 4, 5, 4, 2, 97920),
(118, 30159, '17cucumber8343', 'sdf257', '陳大頭', '1950-01-12', '2012-01-12', 3, 4, 5, 4, 2, 165597),
(119, 47741, '18ming7266', 'sdf698', '王雅玲', '1972-12-27', '2010-07-02', 3, 4, 5, 4, 2, 85896),
(120, 74401, '19cucumber8063', 'oerie794', '李小明', '1941-05-23', '2017-04-29', 3, 4, 5, 4, 2, 75582),
(121, 52060, '20cucumber2245', 'adsfd483', '王雅玲', '1965-08-18', '2012-10-01', 3, 4, 5, 4, 2, 178240),
(122, 83843, '21cucumber1350', 'sdf340', '陳怡君', '1962-07-02', '2017-05-04', 3, 4, 5, 4, 2, 194502),
(123, 77344, '22ming9348', 'adsfd520', '林小明', '1961-03-27', '2017-03-13', 3, 4, 5, 4, 2, 117898),
(124, 38267, '23yyy8215', 'eesf342', '吳怡君', '1976-02-12', '2015-07-18', 3, 4, 5, 4, 2, 129904),
(125, 94670, '24cucumber5759', 'oerie524', '林雅玲', '1980-11-19', '2022-03-11', 3, 4, 5, 4, 2, 201336),
(126, 88967, '25nana1017', 'eesf895', '林小明', '1963-05-25', '2022-10-15', 3, 4, 5, 4, 2, 161075),
(127, 19801, '26edward5767', 'sdf835', '林大頭', '1944-02-28', '2019-04-04', 3, 4, 5, 4, 2, 195026),
(128, 31428, '27edward8120', 'oerie690', '吳大頭', '1967-06-19', '2013-11-25', 3, 4, 5, 4, 2, 213003),
(129, 47144, '28cucumber6483', 'eesf393', '吳雅玲', '1961-12-05', '2010-01-27', 3, 4, 5, 4, 2, 126336),
(130, 32396, '29cucumber4545', 'eesf669', '王怡君', '1981-02-19', '2019-05-12', 3, 4, 5, 4, 2, 231507),
(131, 79970, '30yyy3457', 'sdf182', '王怡君', '1949-05-12', '2022-11-01', 3, 4, 5, 4, 2, 227490),
(132, 15367, '31ming5602', 'sdf812', '李小華', '1941-10-19', '2012-07-28', 3, 4, 5, 4, 2, 54684),
(133, 65601, '32yyy9353', 'eesf809', '陳小華', '1959-10-30', '2015-07-26', 3, 4, 5, 4, 2, 89280),
(134, 72627, '33yyy3662', 'adsfd246', '吳怡君', '1954-01-07', '2016-10-26', 3, 4, 5, 4, 2, 187341),
(135, 66445, '34nana8340', 'eesf965', '吳小明', '1983-07-05', '2017-01-19', 3, 4, 5, 4, 2, 225454),
(136, 45563, '35cucumber6284', 'sdf559', '王小明', '1957-10-04', '2011-10-26', 3, 4, 5, 4, 2, 36015),
(137, 48297, '36yyy8606', 'sdf733', '吳雅玲', '1954-03-11', '2012-10-03', 3, 4, 5, 4, 2, 208584),
(138, 29364, '37yyy3341', 'adsfd433', '李小華', '1974-09-04', '2020-11-28', 3, 4, 5, 4, 2, 170681),
(139, 57618, '38ming5898', 'eesf376', '吳小華', '1980-02-25', '2015-05-06', 3, 4, 5, 4, 2, 246810),
(140, 54846, '39cucumber8310', 'adsfd738', '李怡君', '1968-04-04', '2019-05-13', 3, 4, 5, 4, 2, 260754),
(141, 57392, '40nana4177', 'eesf834', '林怡君', '1951-03-29', '2015-12-29', 3, 4, 5, 4, 2, 198480),
(142, 39717, '41yyy5246', 'oerie673', '王小華', '1978-12-01', '2014-11-28', 3, 4, 5, 4, 2, 47724),
(143, 27238, '42edward7241', 'sdf705', '李小明', '1954-05-10', '2011-03-14', 3, 4, 5, 4, 2, 81060),
(144, 18272, '43edward8386', 'sdf158', '吳大頭', '1943-08-08', '2011-08-02', 3, 4, 5, 4, 2, 151790),
(145, 55758, '44edward1545', 'eesf245', '陳小華', '1979-06-19', '2017-08-24', 3, 4, 5, 4, 2, 87032),
(146, 93482, '45cucumber2627', 'adsfd451', '林小華', '1946-01-12', '2013-08-02', 3, 4, 5, 4, 2, 179100),
(147, 56631, '46yyy7708', 'adsfd767', '林小華', '1957-05-10', '2020-05-15', 3, 4, 5, 4, 2, 430008),
(148, 95187, '47yyy8236', 'oerie573', '吳怡君', '1974-10-17', '2016-08-28', 3, 4, 5, 4, 2, 122482),
(149, 94359, '48cucumber3567', 'oerie874', '陳小華', '1960-06-14', '2017-04-02', 3, 4, 5, 4, 2, 477456),
(150, 76542, '49yyy6862', 'adsfd303', '吳大頭', '1961-09-20', '2013-05-30', 3, 4, 5, 4, 2, 82614),
(151, 29613, '50ming5747', 'adsfd224', '林小華', '1976-09-11', '2011-02-27', 3, 4, 5, 4, 2, 194150),
(152, 48686, '51edward3456', 'sdf295', '王怡君', '1971-08-30', '2021-05-13', 3, 4, 5, 4, 2, 283968),
(153, 12970, '52nana9844', 'eesf103', '李小華', '1952-08-04', '2022-11-19', 3, 4, 5, 4, 2, 125476),
(154, 50115, '53cucumber8370', 'eesf761', '陳大頭', '1959-07-11', '2017-05-14', 3, 4, 5, 4, 2, 311110),
(155, 91162, '54nana4516', 'eesf232', '吳小華', '1971-08-23', '2013-11-28', 3, 4, 5, 4, 2, 447984),
(156, 56626, '55ming4155', 'eesf767', '吳大頭', '1955-11-13', '2015-09-10', 3, 4, 5, 4, 2, 474320),
(157, 30158, '56edward6572', 'eesf673', '王雅玲', '1942-06-06', '2019-11-29', 3, 4, 5, 4, 2, 249536),
(158, 59068, '57ming3501', 'oerie968', '林小明', '1954-08-18', '2021-04-10', 3, 4, 5, 4, 2, 531639),
(159, 26782, '58yyy1683', 'sdf663', '林小華', '1953-12-09', '2012-03-31', 3, 4, 5, 4, 2, 562774),
(160, 78947, '59cucumber5833', 'adsfd141', '林怡君', '1985-10-03', '2010-02-01', 3, 4, 5, 4, 2, 117705),
(161, 70567, '60ming7999', 'oerie536', '陳小華', '1979-08-13', '2015-12-26', 3, 4, 5, 4, 2, 400320),
(162, 54933, '61yyy1279', 'sdf295', '王小明', '1960-01-05', '2010-05-03', 3, 4, 5, 4, 2, 306220),
(163, 89543, '62nana4205', 'sdf439', '王雅玲', '1985-10-03', '2022-01-30', 3, 4, 5, 4, 2, 343852),
(164, 98374, '63nana1381', 'sdf448', '陳小華', '1951-06-07', '2020-04-13', 3, 4, 5, 4, 2, 307944),
(165, 91615, '64nana6770', 'oerie252', '林大頭', '1955-01-22', '2021-01-15', 3, 4, 5, 4, 2, 568064),
(166, 84581, '65cucumber6104', 'oerie603', '林小華', '1965-04-30', '2019-04-05', 3, 4, 5, 4, 2, 409955),
(167, 58073, '66edward1664', 'eesf268', '李大頭', '1948-05-20', '2011-05-08', 3, 4, 5, 4, 2, 536250),
(168, 29434, '67yyy4218', 'sdf295', '陳怡君', '1968-12-30', '2012-02-12', 3, 4, 5, 4, 2, 501562),
(169, 72647, '68cucumber5597', 'adsfd975', '陳小明', '1948-10-18', '2019-03-06', 3, 4, 5, 4, 2, 155652),
(170, 16453, '69yyy1668', 'adsfd416', '林怡君', '1950-01-22', '2013-07-09', 3, 4, 5, 4, 2, 458919),
(171, 81235, '70yyy6525', 'oerie173', '陳大頭', '1955-08-24', '2021-03-30', 3, 4, 5, 4, 2, 675360),
(172, 23486, '71ming5938', 'eesf406', '李雅玲', '1958-05-27', '2012-07-08', 3, 4, 5, 4, 2, 218751),
(173, 56269, '72cucumber3032', 'sdf889', '王大頭', '1976-08-13', '2021-02-11', 3, 4, 5, 4, 2, 164160),
(174, 66690, '73nana3258', 'eesf473', '林小華', '1947-06-09', '2022-03-22', 3, 4, 5, 4, 2, 334559),
(175, 59065, '74ming4471', 'eesf974', '王小華', '1940-10-25', '2019-04-29', 3, 4, 5, 4, 2, 231324),
(176, 49490, '75ming7529', 'oerie265', '陳大頭', '1978-01-15', '2021-05-19', 3, 4, 5, 4, 2, 534150),
(177, 70307, '76nana6600', 'sdf523', '王大頭', '1945-03-02', '2010-05-31', 3, 4, 5, 4, 2, 168720),
(178, 36329, '77nana3978', 'sdf234', '李小華', '1961-02-23', '2019-04-28', 3, 4, 5, 4, 2, 571263),
(179, 23971, '78ming3365', 'sdf963', '李怡君', '1942-04-19', '2015-05-19', 3, 4, 5, 4, 2, 115128),
(180, 44480, '79yyy8566', 'eesf288', '王大頭', '1945-11-21', '2020-08-07', 3, 4, 5, 4, 2, 679163),
(181, 33374, '80nana5639', 'eesf470', '陳小華', '1965-05-03', '2014-04-22', 3, 4, 5, 4, 2, 98560),
(182, 43551, '81ming1947', 'sdf319', '王小明', '1979-08-29', '2021-07-21', 3, 4, 5, 4, 2, 508032),
(183, 38554, '82nana6131', 'sdf714', '王小明', '1979-01-09', '2020-11-09', 3, 4, 5, 4, 2, 129888),
(184, 84391, '83ming1323', 'oerie819', '陳大頭', '1947-07-05', '2012-09-11', 3, 4, 5, 4, 2, 158862),
(185, 43239, '84ming5740', 'adsfd705', '吳大頭', '1945-09-06', '2017-11-13', 3, 4, 5, 4, 2, 326004),
(186, 99636, '85ming7172', 'adsfd440', '林怡君', '1944-06-02', '2019-11-06', 3, 4, 5, 4, 2, 226525),
(187, 78057, '86edward3947', 'sdf697', '李怡君', '1973-09-14', '2020-01-19', 3, 4, 5, 4, 2, 457176),
(188, 69056, '87yyy2290', 'eesf457', '李雅玲', '1978-04-06', '2018-04-05', 3, 4, 5, 4, 2, 773691),
(189, 16746, '88ming1981', 'oerie859', '陳怡君', '1965-05-17', '2020-08-12', 3, 4, 5, 4, 2, 200200),
(190, 83910, '89yyy9873', 'eesf242', '陳大頭', '1985-11-29', '2021-03-25', 3, 4, 5, 4, 2, 134301),
(191, 26778, '90ming5434', 'sdf610', '王大頭', '1946-06-09', '2013-09-10', 3, 4, 5, 4, 2, 161460),
(192, 77469, '91edward5532', 'eesf634', '李雅玲', '1980-08-02', '2017-06-29', 3, 4, 5, 4, 2, 528528),
(193, 30184, '92nana2372', 'eesf779', '李怡君', '1957-09-08', '2011-05-07', 3, 4, 5, 4, 2, 373520),
(194, 68522, '93ming6657', 'adsfd449', '吳雅玲', '1982-05-14', '2022-05-11', 3, 4, 5, 4, 2, 758322),
(195, 17873, '94yyy4322', 'oerie599', '吳雅玲', '1941-03-27', '2010-01-15', 3, 4, 5, 4, 2, 128780),
(196, 67394, '95cucumber4170', 'eesf283', '吳小華', '1963-09-23', '2020-07-07', 3, 4, 5, 4, 2, 870485),
(197, 78279, '96ming8292', 'oerie542', '李雅玲', '1958-06-02', '2018-12-28', 3, 4, 5, 4, 2, 362592),
(198, 58205, '97cucumber6644', 'adsfd522', '陳大頭', '1971-06-19', '2015-05-13', 3, 4, 5, 4, 2, 653198),
(199, 86241, '98cucumber4953', 'adsfd199', '吳雅玲', '1958-04-21', '2016-02-15', 3, 4, 5, 4, 2, 742938),
(200, 18165, '99yyy3250', 'oerie596', '陳大頭', '1978-01-15', '2019-09-25', 3, 4, 5, 4, 2, 328581);

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `good_deed_games`
--
ALTER TABLE `good_deed_games`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `good_deed_games_record`
--
ALTER TABLE `good_deed_games_record`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `good_deed_score`
--
ALTER TABLE `good_deed_score`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `good_deed_test`
--
ALTER TABLE `good_deed_test`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `good_deed_test_record`
--
ALTER TABLE `good_deed_test_record`
  ADD PRIMARY KEY (`sid`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `good_deed_games`
--
ALTER TABLE `good_deed_games`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `good_deed_games_record`
--
ALTER TABLE `good_deed_games_record`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `good_deed_score`
--
ALTER TABLE `good_deed_score`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `good_deed_test`
--
ALTER TABLE `good_deed_test`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `good_deed_test_record`
--
ALTER TABLE `good_deed_test_record`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=201;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
